RRpair/medicare-req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservicex.net/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetSupplierByZipCode>
         <!--Optional:-->
         <web:zip>60532</web:zip>
      </web:GetSupplierByZipCode>
   </soapenv:Body>
</soapenv:Envelope>